stm32LLD/uart/src/uart.c
    for ( uint8_t ch = 0U; ch < eUART_CH_NUM_OF; ch++ )
    {
        // Get UART configurations
        const uart_cfg_t * p_uart_cfg = uart_cfg_get_config( ch );

        if ( p_inst == p_uart_cfg->p_instance )
        {
            found = true;
            *p_ch = ch;
            break;
        }
    }

    return found;
}

////////////////////////////////////////////////////////////////////////////////
/*!
* @brief        Process UART ISR
*
* @param[in]    uart_ch    - UART communication channel
* @return       void
*/
////////////////////////////////////////////////////////////////////////////////
static inline void uart_process_isr(const USART_TypeDef * p_inst)
{
    uint8_t              u8_data    = 0U;
    uart_ch_t            uart_ch    = 0;
    ring_buffer_status_t buf_status = eRING_BUFFER_OK;

    // Find UART channel by hardware instance
    if ( true == uart_find_channel( p_inst, &uart_ch ))
    {
        // UART overrun error
        if ( __HAL_UART_GET_FLAG( &g_uart[uart_ch].handle, UART_FLAG_ORE ))
        {
            __HAL_UART_CLEAR_FLAG( &g_uart[uart_ch].handle, UART_FLAG_ORE );

            // Discard received character
            (void) g_uart[uart_ch].handle.Instance->RDR;
        }

        // Framing error
        else if ( __HAL_UART_GET_FLAG( &g_uart[uart_ch].handle, UART_FLAG_FE ))
        {
            __HAL_UART_CLEAR_FLAG( &g_uart[uart_ch].handle, UART_FLAG_FE );

            // Discard received character
            (void) g_uart[uart_ch].handle.Instance->RDR;
        }

        // Noise error
        else if ( __HAL_UART_GET_FLAG( &g_uart[uart_ch].handle, UART_FLAG_NE ))
        {
            __HAL_UART_CLEAR_FLAG( &g_uart[uart_ch].handle, UART_FLAG_NE );

            // Discard received character
            (void) g_uart[uart_ch].handle.Instance->RDR;
        }

        // UART read data register not empty
        else if( __HAL_UART_GET_FLAG( &g_uart[uart_ch].handle, UART_FLAG_RXNE ))
        {
            // 8bit or 7bit per frame
            if ( UART_WORDLENGTH_9B != g_uart[uart_ch].handle.Init.WordLength )
            {
                // Get received character
                u8_data = g_uart[uart_ch].handle.Instance->RDR;

                // Put to buffer
                (void) ring_buffer_add( g_uart[uart_ch].rx_buf, &u8_data );
            }

            // 9 bit per frame
            else
            {
                // Get received character
                const uint16_t u16_data = g_uart[uart_ch].handle.Instance->RDR;
                const uint8_t lsb_data = ( u16_data & 0xFFU );
                const uint8_t msb_data = (( u16_data >> 8U ) & 0xFFU );

                // Put to buffer
                (void) ring_buffer_add( g_uart[uart_ch].rx_buf, &lsb_data );
                (void) ring_buffer_add( g_uart[uart_ch].rx_buf, &msb_data );
            }
        }

        // UART transmit data register empty
        else if( __HAL_UART_GET_FLAG( &g_uart[uart_ch].handle, UART_FLAG_TXE ))
        {
            // 8bit or 7bit per frame
            if ( UART_WORDLENGTH_9B != g_uart[uart_ch].handle.Init.WordLength )
            {
                // Take data from Tx buffer and send it
                if ( eRING_BUFFER_OK == ring_buffer_get( g_uart[uart_ch].tx_buf, &u8_data ))
                {
                    g_uart[uart_ch].handle.Instance->TDR = u8_data;
                }

                // Tx FIFO empty -> stop TXE interrupt
                else
                {
                    __HAL_UART_DISABLE_IT( &g_uart[uart_ch].handle, UART_IT_TXE );
                }
            }

            // 9 bit per frame
            else
            {
                uint8_t lsb_data, msb_data = 0;

                // Take two bytes out of buffer
                buf_status = ring_buffer_get( g_uart[uart_ch].tx_buf, &lsb_data );
                buf_status |= ring_buffer_get( g_uart[uart_ch].tx_buf, &msb_data );

                const uint16_t u16_data = (( msb_data << 8U ) | lsb_data );

                // Take data from Tx buffer and send it
                if ( eRING_BUFFER_OK == buf_status )
                {
                    g_uart[uart_ch].handle.Instance->TDR = u16_data;
                }

                // Tx FIFO empty -> stop TXE interrupt
                else
                {
                    __HAL_UART_DISABLE_IT( &g_uart[uart_ch].handle, UART_IT_TXE );
                }
            }
        }

        else
        {
            // No actions...
        }
    }
}

#if defined(USART1)
    ////////////////////////////////////////////////////////////////////////////////
    /*!
    * @brief        USART 1 ISR
    *
    * @return       void
    */
    ////////////////////////////////////////////////////////////////////////////////
    void USART1_IRQHandler(void)
    {
        uart_process_isr( USART1 );
    }
#endif

#if defined(USART2)
    ////////////////////////////////////////////////////////////////////////////////
    /*!
    * @brief        USART 2 ISR
    *
    * @return       void
    */
    ////////////////////////////////////////////////////////////////////////////////
    void USART2_IRQHandler(void)
    {
        uart_process_isr( USART2 );
    }
#endif

#if defined(USART3)
    ////////////////////////////////////////////////////////////////////////////////
    /*!
    * @brief        USART 3 ISR
    *
    * @return       void
    */
    ////////////////////////////////////////////////////////////////////////////////
    void USART3_IRQHandler(void)
    {
        uart_process_isr( USART3 );
    }
#endif

#if defined(UART4)
    ////////////////////////////////////////////////////////////////////////////////
    /*!
    * @brief        UART 4 ISR
    *
    * @return       void
    */
    ////////////////////////////////////////////////////////////////////////////////
    void UART4_IRQHandler(void)
    {
        uart_process_isr( UART4 );
    }
#endif

#if defined(UART5)
    ////////////////////////////////////////////////////////////////////////////////
    /*!
    * @brief        UART 5 ISR
    *
    * @return       void
    */
    ////////////////////////////////////////////////////////////////////////////////
    void UART5_IRQHandler(void)
    {
        uart_process_isr( UART5 );
    }
#endif

#if defined(UART7)
    ////////////////////////////////////////////////////////////////////////////////
    /*!
    * @brief        UART 7 ISR
    *
    * @return       void
    */
    ////////////////////////////////////////////////////////////////////////////////
    void UART7_IRQHandler(void)
    {
        uart_process_isr( UART7 );
    }
#endif

#if defined(UART8)
    ////////////////////////////////////////////////////////////////////////////////
    /*!
    * @brief        UART 8 ISR
    *
    * @return       void
    */
    ////////////////////////////////////////////////////////////////////////////////
    void UART8_IRQHandler(void)
    {
        uart_process_isr( UART8 );
    }
#endif

////////////////////////////////////////////////////////////////////////////////
/**
* @} <!-- END GROUP -->
*/
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
/**
*@addtogroup UART_API
* @{ <!-- BEGIN GROUP -->
*
* 	Following function are part of UART API.
*/
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
/*!
* @brief        Initialize UART
*
* @param[in]    uart_ch     - UART communication channel
* @return       status      - Status of operation
*/
////////////////////////////////////////////////////////////////////////////////
uart_status_t uart_init(const uart_ch_t uart_ch)
{
    uart_status_t status = eUART_OK;

    UART_ASSERT( uart_ch < eUART_CH_NUM_OF );

    if ( uart_ch < eUART_CH_NUM_OF )
    {
        if  ( false == g_uart[uart_ch].is_init )
        {
            // Get UART configurations
            const uart_cfg_t * p_uart_cfg = uart_cfg_get_config( uart_ch );

            // Init FIFO
            status |= uart_init_fifo( uart_ch, p_uart_cfg->tx_buf_size, p_uart_cfg->rx_buf_size );

            // Init GPIOs
            uart_init_gpio( &( p_uart_cfg->tx_pin ));
            uart_init_gpio( &( p_uart_cfg->rx_pin ));

            // Enable clock
            uart_enable_clock( p_uart_cfg->p_instance );

            // Prepare HAL init structure
            g_uart[uart_ch].handle.Instance                    = p_uart_cfg->p_instance;
            g_uart[uart_ch].handle.Init.BaudRate               = p_uart_cfg->baudrate;
            g_uart[uart_ch].handle.Init.WordLength             = p_uart_cfg->bits_per_frame;
            g_uart[uart_ch].handle.Init.StopBits               = UART_STOPBITS_1;
            g_uart[uart_ch].handle.Init.Parity                 = UART_PARITY_NONE;
            g_uart[uart_ch].handle.Init.Mode                   = UART_MODE_TX_RX;
            g_uart[uart_ch].handle.Init.HwFlowCtl              = UART_HWCONTROL_NONE;
            g_uart[uart_ch].handle.Init.OverSampling           = UART_OVERSAMPLING_16;
            g_uart[uart_ch].handle.Init.OneBitSampling         = UART_ONE_BIT_SAMPLE_DISABLE;

